dasdasd12/hardware/firmware/h417_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbss.c
/*
 * Copyright (c) 2026
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#include "usb_dc_ch32h417_usbss.h"

#include <rtthread.h>
#include <string.h>

#include "board.h"
#include "ch32h417.h"

#define USBSS_READY_FLAG_ADDR  ((volatile uint32_t *)0x20178020u)
#define USBSS_READY_FLAG_VALUE 0xABCD1234u
#define USBSS_FAILED_FLAG_VALUE 0xDEADBEEFu
#define USBSS_READY_TIMEOUT_MS 60000U
#define USBSS_EP_BUFFER_SIZE   1024U
#define USBSS_V3F_TRACE_BASE   ((volatile uint32_t *)0x20178000u)
#define USBSS_V3F_STAGE_PLL_BEGIN 7U
#define USBSS_V3F_STAGE_WAIT_TIMEOUT 1000000U
#define USBSS_LINK_BUSY_TIMEOUT  400000U
#define USBSS_LINK_SWEEP_DELAY   12000000U
#define USBSS_LINK_SAMPLE_COUNT  1000000U
#define USBSS_USE_V3F_LINK_INIT  1U
#define USBSS_ENABLE_LINK_SWEEP  0U
#define USBSS_HS_FALLBACK_REASON_DISABLE  1U
#define USBSS_HS_FALLBACK_REASON_INACTIVE 2U

#define USBSS_PHY_CFG_CR       (*((__IO uint32_t *)0x400341F8U))
#define USBSS_PHY_CFG_DAT      (*((__IO uint32_t *)0x400341FCU))

#define LMP_HP                 0U
#define LMP_SUBTYPE_MASK       (0x0FU << 5)
#define LMP_SET_LINK_FUNC      (0x01U << 5)
#define LMP_U2_INACT_TOUT      (0x02U << 5)
#define LMP_PORT_CAP           (0x04U << 5)
#define LMP_PORT_CFG           (0x05U << 5)
#define LMP_PORT_CFG_RES       (0x06U << 5)
#define LMP_LINK_SPEED         (1U << 9)
#define NUM_HP_BUF             (4U << 0)
#define DOWN_STREAM            (1U << 16)
#define UP_STREAM              (2U << 16)

struct usb_dc_ep_state {
    uint16_t ep_mps;
    uint8_t ep_type;
    uint8_t ep_stalled;
    uint8_t ep_enabled;
    uint8_t ep_toggle;
    uint8_t *xfer_buf;
    uint32_t xfer_len;
    uint32_t actual_xfer_len;
};

struct ch32h417_usbss_udc {
    volatile uint8_t dev_addr;
    uint8_t addr_pending;
    uint8_t port_speed;
    struct usb_dc_ep_state in_ep[USB_CH32H417_MAX_EP_NUM];
    struct usb_dc_ep_state out_ep[USB_CH32H417_MAX_EP_NUM];
};

struct ch32h417_usbss_diag {
    volatile uint32_t irq;
    volatile uint32_t link_irq;
    volatile uint32_t setup;
    volatile uint32_t status;
    volatile uint32_t transfer;
    volatile uint32_t ep0_prime_in;
    volatile uint32_t ep0_in;
    volatile uint32_t ep0_prime_out;
    volatile uint32_t ep0_out;
    volatile uint32_t set_addr;
    volatile uint32_t stall;
    volatile uint32_t reset;
    volatile uint32_t u0;
    volatile uint32_t rxdet;
    volatile uint32_t hotrst;
    volatile uint32_t warmrst;
    volatile uint32_t last_status;
    volatile uint32_t last_link_int;
    volatile uint32_t last_link_state;
    volatile uint32_t last_link_status;
    volatile uint32_t last_setup0;
    volatile uint32_t last_setup1;
    volatile uint32_t last_resp0;
    volatile uint32_t last_tx_len;
    volatile uint32_t last_rx_len;
    volatile uint32_t last_addr;
    volatile uint32_t rxdet_no_reset;
    volatile uint32_t rxdet_flag;
    volatile uint32_t disable_flag;
    volatile uint32_t disable;
    volatile uint32_t inactive;
    volatile uint32_t polling;
    volatile uint32_t recovery;
    volatile uint32_t u1;
    volatile uint32_t u2;
    volatile uint32_t u3;
    volatile uint32_t rx_detect_seen;
    volatile uint32_t rx_lfps_seen;
    volatile uint32_t term_seen;
    volatile uint32_t ready_seen;
    volatile uint32_t polling_enable;
    volatile uint32_t ready_flag;
    volatile uint32_t ux_fail_flag;
    volatile uint32_t ux_exit_fail_flag;
    volatile uint32_t go_u0_flag;
    volatile uint32_t recovery_flag;
    volatile uint32_t inactive_flag;
    volatile uint32_t txeq_flag;
    volatile uint32_t ux_rej_flag;
    volatile uint32_t rx_lmp_tout_flag;
    volatile uint32_t phy_r03;
    volatile uint32_t phy_r0d;
    volatile uint32_t phy_r11;
    volatile uint32_t phy_r12;
    volatile uint32_t phy_r13;
    volatile uint32_t phy_r15;
    volatile uint32_t phy_cfg_cr;
    volatile uint32_t phy_cfg_dat;
    volatile uint32_t phy_mod;
    volatile uint32_t rcc_ctlr;
    volatile uint32_t rcc_pllcfgr2;
    volatile uint32_t rcc_hbpcenr;
    volatile uint32_t link_busy_wait;
    volatile uint32_t post_busy_status;
    volatile uint32_t post_term_status;
    volatile uint32_t sample_count;
    volatile uint32_t sample_first;
    volatile uint32_t sample_last;
    volatile uint32_t sample_or;
    volatile uint32_t sample_and;
    volatile uint32_t sample_rxdet;
    volatile uint32_t sample_lfps;
    volatile uint32_t sample_term;
    volatile uint32_t sample_ready;
    volatile uint32_t sample_disable;
    volatile uint32_t sample_polling;
    volatile uint32_t sample_recovery;
    volatile uint32_t sample_u0;
};

static struct ch32h417_usbss_udc g_ch32h417_usbss_udc;
static struct ch32h417_usbss_diag g_ch32h417_usbss_diag;
static uint8_t g_ch32h417_usbss_sweep_done;
static volatile uint8_t g_ch32h417_usbss_hs_fallback_request;
static volatile uint32_t g_ch32h417_usbss_hs_fallback_reason;

static USB_NOCACHE_RAM_SECTION USB_MEM_ALIGNX uint8_t usbss_ep0_buffer[USB_CH32H417_SS_EP0_MPS];
static USB_NOCACHE_RAM_SECTION USB_MEM_ALIGNX uint8_t usbss_ep_tx_buffer[USB_CH32H417_MAX_EP_NUM][USBSS_EP_BUFFER_SIZE];
static USB_NOCACHE_RAM_SECTION USB_MEM_ALIGNX uint8_t usbss_ep_rx_buffer[USB_CH32H417_MAX_EP_NUM][USBSS_EP_BUFFER_SIZE];

static void usbss_delay(uint32_t cycles)
{
    volatile uint32_t i;

    for (i = 0U; i < cycles; i++) {
        __NOP();
    }
}

static uint32_t usbss_pack4(const uint8_t *data)
{
    if (data == RT_NULL) {
        return 0U;
    }

    return ((uint32_t)data[0]) |
           ((uint32_t)data[1] << 8) |
           ((uint32_t)data[2] << 16) |
           ((uint32_t)data[3] << 24);
}

static USBSS_EP_TX_TypeDef *usbss_tx_ep(uint8_t ep_idx)
{
    switch (ep_idx) {
    case 1U:
        return (USBSS_EP_TX_TypeDef *)&USBSSD->EP1_TX;
    case 2U:
        return (USBSS_EP_TX_TypeDef *)&USBSSD->EP2_TX;
    case 3U:
        return (USBSS_EP_TX_TypeDef *)&USBSSD->EP3_TX;
    case 4U:
        return (USBSS_EP_TX_TypeDef *)&USBSSD->EP4_TX;
    case 5U:
        return (USBSS_EP_TX_TypeDef *)&USBSSD->EP5_TX;
    case 6U:
        return (USBSS_EP_TX_TypeDef *)&USBSSD->EP6_TX;
    case 7U:
        return (USBSS_EP_TX_TypeDef *)&USBSSD->EP7_TX;
    default:
        return RT_NULL;
    }
}

static USBSS_EP_RX_TypeDef *usbss_rx_ep(uint8_t ep_idx)
{
    switch (ep_idx) {
    case 1U:
        return (USBSS_EP_RX_TypeDef *)&USBSSD->EP1_RX;
    case 2U:
        return (USBSS_EP_RX_TypeDef *)&USBSSD->EP2_RX;
    case 3U:
        return (USBSS_EP_RX_TypeDef *)&USBSSD->EP3_RX;
    case 4U:
        return (USBSS_EP_RX_TypeDef *)&USBSSD->EP4_RX;
    case 5U:
        return (USBSS_EP_RX_TypeDef *)&USBSSD->EP5_RX;
    case 6U:
        return (USBSS_EP_RX_TypeDef *)&USBSSD->EP6_RX;
    case 7U:
        return (USBSS_EP_RX_TypeDef *)&USBSSD->EP7_RX;
    default:
        return RT_NULL;
    }
}

