dasdasd12/hardware/firmware/h417_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbss.c
static uint32_t usbss_phy_cfg(uint8_t port_num, uint8_t addr, uint16_t data)
{
    if (port_num != 0U) {
        return 0U;
    }

    USBSS_PHY_CFG_CR = (1UL << 23) | ((uint32_t)addr << 16) | data;
    USBSS_PHY_CFG_DAT = 0x01U;
    return USBSS_PHY_CFG_DAT;
}

static uint32_t usbss_phy_read(uint8_t port_num, uint8_t addr)
{
    if (port_num != 0U) {
        return 0U;
    }

    USBSS_PHY_CFG_CR &= ~(0x1FU << 16);
    USBSS_PHY_CFG_CR = ((0x1FU << 16) | 0x0U) | (1U << 23);
    USBSS_PHY_CFG_DAT = 0x1U;
    USBSS_PHY_CFG_CR &= ~(0x1FU << 16);
    USBSS_PHY_CFG_CR = ((uint32_t)addr << 16);
    return USBSS_PHY_CFG_DAT;
}

static void __attribute__((unused)) usbss_cfg_mod(void)
{
    usbss_phy_cfg(0U, 0x03U, 0x7C12U);
    usbss_phy_cfg(0U, 0x0DU, 0x79AAU);
    usbss_phy_cfg(0U, 0x15U, 0x4430U);
    usbss_phy_cfg(0U, 0x13U, 0x0010U);
    *((__IO uint32_t *)0x5003C018U) = 0xB0054000U;
}

static void usbss_snapshot_phy_diag(void)
{
    g_ch32h417_usbss_diag.phy_r03 = usbss_phy_read(0U, 0x03U);
    g_ch32h417_usbss_diag.phy_r0d = usbss_phy_read(0U, 0x0DU);
    g_ch32h417_usbss_diag.phy_r11 = usbss_phy_read(0U, 0x11U);
    g_ch32h417_usbss_diag.phy_r12 = usbss_phy_read(0U, 0x12U);
    g_ch32h417_usbss_diag.phy_r13 = usbss_phy_read(0U, 0x13U);
    g_ch32h417_usbss_diag.phy_r15 = usbss_phy_read(0U, 0x15U);
    g_ch32h417_usbss_diag.phy_cfg_cr = USBSS_PHY_CFG_CR;
    g_ch32h417_usbss_diag.phy_cfg_dat = USBSS_PHY_CFG_DAT;
    g_ch32h417_usbss_diag.phy_mod = *((__IO uint32_t *)0x5003C018U);
    g_ch32h417_usbss_diag.rcc_ctlr = RCC->CTLR;
    g_ch32h417_usbss_diag.rcc_pllcfgr2 = RCC->PLLCFGR2;
    g_ch32h417_usbss_diag.rcc_hbpcenr = RCC->HBPCENR;
}

static void usbss_sample_link_window(void)
{
    static uint8_t sampled;
    uint32_t i;
    uint32_t first = 0U;
    uint32_t last = 0U;
    uint32_t sample_or = 0U;
    uint32_t sample_and = 0xFFFFFFFFU;
    uint32_t rxdet = 0U;
    uint32_t lfps = 0U;
    uint32_t term = 0U;
    uint32_t ready = 0U;
    uint32_t disable = 0U;
    uint32_t polling = 0U;
    uint32_t recovery = 0U;
    uint32_t u0 = 0U;

    if (sampled != 0U) {
        return;
    }
    sampled = 1U;

    for (i = 0U; i < USBSS_LINK_SAMPLE_COUNT; i++) {
        uint32_t status = USBSSD->LINK_STATUS;
        uint32_t state = status & LINK_STATE_MASK;

        if (i == 0U) {
            first = status;
        }
        last = status;
        sample_or |= status;
        sample_and &= status;

        if ((status & LINK_RX_DETECT) != 0U) {
            rxdet++;
        }
        if ((status & LINK_RX_LFPS) != 0U) {
            lfps++;
        }
        if ((status & LINK_RX_TERM_PRES) != 0U) {
            term++;
        }
        if ((status & LINK_READY) != 0U) {
            ready++;
        }
        if (state == LINK_STATE_DISABLE) {
            disable++;
        } else if (state == LINK_STATE_POLLING) {
            polling++;
        } else if (state == LINK_STATE_RECOVERY) {
            recovery++;
        } else if (state == LINK_STATE_U0) {
            u0++;
        }
    }

    g_ch32h417_usbss_diag.sample_count = USBSS_LINK_SAMPLE_COUNT;
    g_ch32h417_usbss_diag.sample_first = first;
    g_ch32h417_usbss_diag.sample_last = last;
    g_ch32h417_usbss_diag.sample_or = sample_or;
    g_ch32h417_usbss_diag.sample_and = sample_and;
    g_ch32h417_usbss_diag.sample_rxdet = rxdet;
    g_ch32h417_usbss_diag.sample_lfps = lfps;
    g_ch32h417_usbss_diag.sample_term = term;
    g_ch32h417_usbss_diag.sample_ready = ready;
    g_ch32h417_usbss_diag.sample_disable = disable;
    g_ch32h417_usbss_diag.sample_polling = polling;
    g_ch32h417_usbss_diag.sample_recovery = recovery;
    g_ch32h417_usbss_diag.sample_u0 = u0;
}

static int usbss_wait_ready_flag(void)
{
    uint32_t timeout;

    for (timeout = 0U; timeout < USBSS_READY_TIMEOUT_MS; timeout++) {
        uint32_t flag = *USBSS_READY_FLAG_ADDR;

        if (flag == USBSS_READY_FLAG_VALUE) {
            return 0;
        }
        if (flag == USBSS_FAILED_FLAG_VALUE) {
            rt_kprintf("[USBSS] V3F PLL/PHY init failed flag\r\n");
            return -1;
        }
        rt_thread_mdelay(1);
    }

    rt_kprintf("[USBSS] V3F ready flag timeout, flag=0x%08x stage=%u idle=%u cfg=0x%08x st0=0x%08x st1=0x%08x\r\n",
               (unsigned int)*USBSS_READY_FLAG_ADDR,
               (unsigned int)USBSS_V3F_TRACE_BASE[1],
               (unsigned int)USBSS_V3F_TRACE_BASE[4],
               (unsigned int)USBSS_V3F_TRACE_BASE[11],
               (unsigned int)USBSS_V3F_TRACE_BASE[13],
               (unsigned int)USBSS_V3F_TRACE_BASE[14]);
    return -1;
}

static uint32_t usbss_wait_v3f_post_ready(void)
{
    uint32_t timeout;

    for (timeout = 0U; timeout < USBSS_V3F_STAGE_WAIT_TIMEOUT; timeout++) {
        if (USBSS_V3F_TRACE_BASE[1] != USBSS_V3F_STAGE_PLL_BEGIN) {
            break;
        }
        __NOP();
    }

    return timeout;
}

static void usbss_enable_v5f_clock_gates(void)
{
    RCC_HBPeriphClockCmd(RCC_HBPeriph_USBSS, ENABLE);
    RCC_PIPECmd(ENABLE);
    RCC_UTMIcmd(ENABLE);
    RCC_USBSS_PLLCmd(ENABLE);
}

static void usbss_ep0_state_init(void)
{
    g_ch32h417_usbss_udc.out_ep[0].ep_mps = USB_CH32H417_SS_EP0_MPS;
    g_ch32h417_usbss_udc.out_ep[0].ep_type = USB_ENDPOINT_TYPE_CONTROL;
    g_ch32h417_usbss_udc.out_ep[0].ep_enabled = 1U;
    g_ch32h417_usbss_udc.out_ep[0].ep_stalled = 0U;
    g_ch32h417_usbss_udc.out_ep[0].ep_toggle = 0U;
    g_ch32h417_usbss_udc.out_ep[0].xfer_buf = RT_NULL;
    g_ch32h417_usbss_udc.out_ep[0].xfer_len = 0U;
    g_ch32h417_usbss_udc.out_ep[0].actual_xfer_len = 0U;

    g_ch32h417_usbss_udc.in_ep[0].ep_mps = USB_CH32H417_SS_EP0_MPS;
    g_ch32h417_usbss_udc.in_ep[0].ep_type = USB_ENDPOINT_TYPE_CONTROL;
    g_ch32h417_usbss_udc.in_ep[0].ep_enabled = 1U;
    g_ch32h417_usbss_udc.in_ep[0].ep_stalled = 0U;
    g_ch32h417_usbss_udc.in_ep[0].ep_toggle = 0U;
    g_ch32h417_usbss_udc.in_ep[0].xfer_buf = RT_NULL;
    g_ch32h417_usbss_udc.in_ep[0].xfer_len = 0U;
    g_ch32h417_usbss_udc.in_ep[0].actual_xfer_len = 0U;

    USBSSD->UEP0_TX_DMA = (uint32_t)usbss_ep0_buffer;
    USBSSD->UEP0_RX_DMA = (uint32_t)usbss_ep0_buffer;
    USBSSD->UEP0_TX_DMA_OFS = 0U;
    USBSSD->UEP0_RX_DMA_OFS = 0U;
    USBSSD->UEP0_TX_CTRL = 0U;
    USBSSD->UEP0_RX_CTRL = 0U;
}

static void usbss_clear_transfer_state(void)
{
    memset(&g_ch32h417_usbss_udc, 0, sizeof(g_ch32h417_usbss_udc));
    g_ch32h417_usbss_udc.port_speed = USB_SPEED_SUPER;
    USBSSD->UEP_TX_EN = 0U;
    USBSSD->UEP_RX_EN = 0U;
    USBSSD->USB_CONTROL |= USBSS_USB_CLR_ALL;
    USBSSD->USB_CONTROL &= ~USBSS_USB_CLR_ALL;
    usbss_ep0_state_init();
}

static void usbss_apply_pending_address(void)
{
    if (g_ch32h417_usbss_udc.addr_pending != 0U) {
        USBSSD->USB_CONTROL &= ~USBSS_DEV_ADDR_MASK;
        USBSSD->USB_CONTROL |= ((uint32_t)(g_ch32h417_usbss_udc.dev_addr & 0x7FU) << 24);
        g_ch32h417_usbss_udc.addr_pending = 0U;
    }
}

static void usbss_ep_prime_in(uint8_t ep_idx, const uint8_t *data, uint32_t data_len)
{
    uint32_t mps = g_ch32h417_usbss_udc.in_ep[ep_idx].ep_mps;

    if ((mps == 0U) || (mps > USBSS_EP_BUFFER_SIZE)) {
        mps = (ep_idx == 0U) ? USB_CH32H417_SS_EP0_MPS : USBSS_EP_BUFFER_SIZE;
    }
    if (data_len > mps) {
        data_len = mps;
    }

    if (ep_idx == 0U) {
        if ((data != RT_NULL) && (data_len != 0U)) {
            memcpy(usbss_ep0_buffer, data, data_len);
        }
        USBSSD->UEP0_TX_DMA = (uint32_t)usbss_ep0_buffer;
        USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_DPH |
                                ((uint32_t)(g_ch32h417_usbss_udc.in_ep[0].ep_toggle + 1U) << 16) |
                                (data_len & USBSS_EP0_TX_LEN_MASK);
        USBSSD->UEP0_TX_CTRL |= USBSS_EP0_TX_ERDY;
        g_ch32h417_usbss_diag.ep0_prime_in++;
        g_ch32h417_usbss_diag.last_tx_len = data_len;
        g_ch32h417_usbss_diag.last_resp0 = usbss_pack4(usbss_ep0_buffer);
        g_ch32h417_usbss_udc.in_ep[0].ep_toggle++;
    } else {
        USBSS_EP_TX_TypeDef *tx = usbss_tx_ep(ep_idx);

        if (tx == RT_NULL) {
            return;
        }

        if ((data != RT_NULL) && (data_len != 0U)) {
            memcpy(usbss_ep_tx_buffer[ep_idx], data, data_len);
        }
        tx->UEP_TX_DMA = (uint32_t)usbss_ep_tx_buffer[ep_idx];
        tx->UEP_TX_DMA_OFS = 0U;
        tx->UEP_TX_CHAIN_LEN = (uint16_t)data_len;
        tx->UEP_TX_CHAIN_EXP_NUMP = 1U;
        tx->UEP_TX_CR = USBSS_EP_TX_CLR | USBSS_EP_TX_CHAIN_CLR;
        tx->UEP_TX_CR = 1U;
    }
}

