dasdasd12/hardware/firmware/h417_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbss.c
static void usbss_ep_prime_out(uint8_t ep_idx)
{
    if (ep_idx == 0U) {
        USBSSD->UEP0_RX_DMA = (uint32_t)usbss_ep0_buffer;
        USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_ACK;
        g_ch32h417_usbss_diag.ep0_prime_out++;
    } else {
        USBSS_EP_RX_TypeDef *rx = usbss_rx_ep(ep_idx);

        if (rx == RT_NULL) {
            return;
        }

        rx->UEP_RX_DMA = (uint32_t)usbss_ep_rx_buffer[ep_idx];
        rx->UEP_RX_DMA_OFS = 0U;
        rx->UEP_RX_CHAIN_MAX_NUMP = 1U;
        rx->UEP_RX_CR = USBSS_EP_RX_CLR | USBSS_EP_RX_CHAIN_CLR;
        rx->UEP_RX_CR = 1U;
    }
}

static void usbss_handle_setup_packet(uint8_t busid)
{
    g_ch32h417_usbss_diag.setup++;
    g_ch32h417_usbss_diag.last_setup0 = usbss_pack4(usbss_ep0_buffer);
    g_ch32h417_usbss_diag.last_setup1 = usbss_pack4(usbss_ep0_buffer + 4);

    g_ch32h417_usbss_udc.out_ep[0].ep_toggle = 0U;
    g_ch32h417_usbss_udc.out_ep[0].actual_xfer_len = 0U;
    g_ch32h417_usbss_udc.out_ep[0].xfer_len = 0U;
    g_ch32h417_usbss_udc.out_ep[0].xfer_buf = RT_NULL;
    g_ch32h417_usbss_udc.in_ep[0].ep_toggle = 0U;
    g_ch32h417_usbss_udc.in_ep[0].actual_xfer_len = 0U;
    g_ch32h417_usbss_udc.in_ep[0].xfer_len = 0U;
    g_ch32h417_usbss_udc.in_ep[0].xfer_buf = RT_NULL;

    usbd_event_ep0_setup_complete_handler(busid, usbss_ep0_buffer);
}

static void usbss_handle_ep_in_xfer_complete(uint8_t busid, uint8_t ep_idx)
{
    struct usb_dc_ep_state *ep = &g_ch32h417_usbss_udc.in_ep[ep_idx];
    uint32_t sent_len;

    if (ep_idx == 0U) {
        sent_len = USBSSD->UEP0_TX_CTRL & USBSS_EP0_TX_LEN_MASK;
        g_ch32h417_usbss_diag.ep0_in++;
        g_ch32h417_usbss_diag.last_tx_len = sent_len;
    } else {
        USBSS_EP_TX_TypeDef *tx = usbss_tx_ep(ep_idx);

        if (tx == RT_NULL) {
            return;
        }
        sent_len = tx->UEP_TX_CHAIN_LEN;
        tx->UEP_TX_CHAIN_ST |= USBSS_EP_TX_CHAIN_IF;
    }

    if (sent_len > ep->xfer_len) {
        sent_len = ep->xfer_len;
    }
    ep->actual_xfer_len += sent_len;
    ep->xfer_len -= sent_len;

    if (ep->xfer_len == 0U) {
        if (ep_idx == 0U) {
            usbd_event_ep_in_complete_handler(busid, USB_CONTROL_IN_EP0, ep->actual_xfer_len);
        } else {
            usbd_event_ep_in_complete_handler(busid, (uint8_t)(ep_idx | 0x80U), ep->actual_xfer_len);
        }
    } else {
        uint32_t next_len = (ep->xfer_len > ep->ep_mps) ? ep->ep_mps : ep->xfer_len;
        usbss_ep_prime_in(ep_idx, ep->xfer_buf + ep->actual_xfer_len, next_len);
    }
}

static void usbss_handle_ep_out_xfer_complete(uint8_t busid, uint8_t ep_idx)
{
    struct usb_dc_ep_state *ep = &g_ch32h417_usbss_udc.out_ep[ep_idx];
    uint32_t rx_len;

    if (ep_idx == 0U) {
        rx_len = USBSSD->UEP0_RX_CTRL & USBSS_EP0_RX_LEN_MASK;
        g_ch32h417_usbss_diag.ep0_out++;
        g_ch32h417_usbss_diag.last_rx_len = rx_len;
    } else {
        USBSS_EP_RX_TypeDef *rx = usbss_rx_ep(ep_idx);

        if (rx == RT_NULL) {
            return;
        }
        rx_len = rx->UEP_RX_CHAIN_LEN;
        rx->UEP_RX_CHAIN_ST |= USBSS_EP_RX_CHAIN_IF;
    }

    if ((ep->xfer_buf != RT_NULL) && (rx_len != 0U)) {
        uint32_t room = (ep->xfer_len > ep->actual_xfer_len) ? (ep->xfer_len - ep->actual_xfer_len) : 0U;
        if (rx_len > room) {
            rx_len = room;
        }
        if (rx_len != 0U) {
            memcpy(ep->xfer_buf + ep->actual_xfer_len,
                   (ep_idx == 0U) ? usbss_ep0_buffer : usbss_ep_rx_buffer[ep_idx],
                   rx_len);
        }
    }

    ep->actual_xfer_len += rx_len;
    if (ep->xfer_len >= rx_len) {
        ep->xfer_len -= rx_len;
    } else {
        ep->xfer_len = 0U;
    }

    if ((ep->xfer_len == 0U) || (rx_len < ep->ep_mps)) {
        if (ep_idx == 0U) {
            usbd_event_ep_out_complete_handler(busid, USB_CONTROL_OUT_EP0, ep->actual_xfer_len);
        } else {
            usbd_event_ep_out_complete_handler(busid, ep_idx, ep->actual_xfer_len);
        }
    } else {
        usbss_ep_prime_out(ep_idx);
    }
}

static void usbss_handle_status_stage(uint8_t busid)
{
    uint8_t next_state = usbd_get_ep0_next_state(busid);

    g_ch32h417_usbss_diag.status++;
    usbss_apply_pending_address();

    if (next_state == USBD_EP0_STATE_OUT_STATUS) {
        usbd_event_ep_out_complete_handler(busid, USB_CONTROL_OUT_EP0, 0U);
    } else if (next_state == USBD_EP0_STATE_IN_STATUS) {
        usbd_event_ep_in_complete_handler(busid, USB_CONTROL_IN_EP0, 0U);
    }

    USBSSD->UEP0_TX_CTRL = 0U;
    USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_ACK;
}

static void usbss_device_reset(uint8_t busid, uint8_t notify_core)
{
    g_ch32h417_usbss_diag.reset++;
    USBSSD->USB_CONTROL |= USBSS_FORCE_RST;
    USBSSD->USB_STATUS = USBSS_UIF_TRANSFER | USBSS_UDIF_SETUP | USBSS_UDIF_STATUS |
                         USBSS_UIF_FIFO_RXOV | USBSS_UIF_FIFO_TXOV | USBSS_UIF_RX_PING |
                         USBSS_UIF_ITP;
    USBSSD->USB_CONTROL = USBSS_UIE_TRANSFER | USBSS_UDIE_SETUP | USBSS_UDIE_STATUS |
                          USBSS_DMA_EN | USBSS_SETUP_FLOW;
    usbss_clear_transfer_state();
    if (notify_core != 0U) {
        usbd_event_reset_handler(busid);
    }
}

static void usbss_enable_link_irqs(void)
{
    USBSSD->LINK_INT_CTRL = LINK_IE_TX_LMP | LINK_IE_RX_LMP | LINK_IE_RX_LMP_TOUT |
                            LINK_IE_STATE_CHG | LINK_IE_WARM_RST | LINK_IE_TERM_PRES |
                            LINK_IE_READY | LINK_IE_UX_FAIL | LINK_IE_UX_EXIT_FAIL |
                            LINK_IE_GO_U0 | LINK_IE_RECOVERY | LINK_IE_INACTIVE |
                            LINK_IE_TXEQ | LINK_IE_UX_REJ;
}

static void usbss_link_program(uint32_t cfg_extra, uint32_t ctrl_extra)
{
    uint32_t timeout;

    USBSSD->LINK_CFG = LINK_RX_EQ_EN | LINK_TX_DEEMPH_MASK | LINK_PHY_RESET;
    USBSSD->LINK_CTRL = LINK_P2_MODE | LINK_GO_DISABLED;
    USBSSD->LINK_CFG = LINK_RX_EQ_EN | LINK_TX_DEEMPH_MASK | LINK_LTSSM_MODE |
                       LINK_TOUT_MODE | cfg_extra;
    USBSSD->LINK_LPM_CR |= LINK_LPM_EN;

