dasdasd12/hardware/firmware/h417_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbss.c
    for (timeout = 0U; timeout < USBSS_LINK_BUSY_TIMEOUT; timeout++) {
        if ((USBSSD->LINK_STATUS & LINK_BUSY) == 0U) {
            break;
        }
        __NOP();
    }
    g_ch32h417_usbss_diag.link_busy_wait = timeout;
    g_ch32h417_usbss_diag.post_busy_status = USBSSD->LINK_STATUS;

    USBSSD->LINK_CFG |= LINK_RX_TERM_EN;
    g_ch32h417_usbss_diag.post_term_status = USBSSD->LINK_STATUS;
    usbss_enable_link_irqs();
    USBSSD->LINK_CTRL = LINK_P2_MODE;
    USBSSD->LINK_U1_WKUP_TMR = 120U;
    USBSSD->LINK_U1_WKUP_FILTER = 50U;
    USBSSD->LINK_U2_WKUP_FILTER = 0U;
    USBSSD->LINK_U3_WKUP_FILTER = 0U;
    USBSSD->LINK_CTRL = LINK_P2_MODE | ctrl_extra;
}

static void usbss_link_init(void)
{
    usbss_link_program(0U, 0U);
}

static void usbss_request_hs_fallback(uint32_t reason)
{
    if (g_ch32h417_usbss_udc.port_speed != USB_SPEED_SUPER) {
        return;
    }
    if (g_ch32h417_usbss_diag.u0 != 0U) {
        return;
    }
    g_ch32h417_usbss_hs_fallback_reason = reason;
    g_ch32h417_usbss_hs_fallback_request = 1U;
}

int usb_dc_ch32h417_usbss_init(uint8_t busid)
{
    if (busid != USB_CH32H417_BUS_SS) {
        return -1;
    }

    uint32_t v3f_wait;

    if (usbss_wait_ready_flag() != 0) {
        return -1;
    }
    v3f_wait = usbss_wait_v3f_post_ready();
    rt_kprintf("[USBSS] V3F trace stage=%u wait=%u idle=%u flag=0x%08x phy=0x%08x mod=0x%08x\r\n",
               (unsigned int)USBSS_V3F_TRACE_BASE[1],
               (unsigned int)v3f_wait,
               (unsigned int)USBSS_V3F_TRACE_BASE[4],
               (unsigned int)USBSS_V3F_TRACE_BASE[8],
               (unsigned int)USBSS_V3F_TRACE_BASE[9],
               (unsigned int)USBSS_V3F_TRACE_BASE[10]);

    usbss_enable_v5f_clock_gates();
    memset(&g_ch32h417_usbss_udc, 0, sizeof(g_ch32h417_usbss_udc));
    g_ch32h417_usbss_udc.port_speed = USB_SPEED_SUPER;

#if USBSS_USE_V3F_LINK_INIT
    g_ch32h417_usbss_sweep_done = 1U;
    usbss_ep0_state_init();
    rt_kprintf("[USBSS] keeping V3F link without V5F reset cfg=0x%08x ctrl=0x%08x st=0x%08x int=0x%08x ie=0x%08x\r\n",
               (unsigned int)USBSSD->LINK_CFG,
               (unsigned int)USBSSD->LINK_CTRL,
               (unsigned int)USBSSD->LINK_STATUS,
               (unsigned int)USBSSD->LINK_INT_FLAG,
               (unsigned int)USBSSD->LINK_INT_CTRL);
#else
    usbss_link_init();
    usbss_cfg_mod();
    usbss_device_reset(busid, 1U);
#endif
    usbss_snapshot_phy_diag();

    NVIC_SetPriority(USBSS_IRQn, 1);
    NVIC_SetPriority(USBSS_LINK_IRQn, 1);
    NVIC_EnableIRQ(USBSS_IRQn);
    NVIC_EnableIRQ(USBSS_LINK_IRQn);
    rt_kprintf("[USBSS] device init done\r\n");
    return 0;
}

int usb_dc_ch32h417_usbss_deinit(uint8_t busid)
{
    (void)busid;

    NVIC_DisableIRQ(USBSS_LINK_IRQn);
    NVIC_DisableIRQ(USBSS_IRQn);
    USBSSD->USB_CONTROL = USBSS_FORCE_RST;
    USBSSD->LINK_CFG |= LINK_PHY_RESET | U3_LINK_RESET;
    usbss_delay(1000U);
    USBSSD->USB_CONTROL &= ~USBSS_FORCE_RST;
    USBSSD->LINK_CFG &= ~(LINK_PHY_RESET | U3_LINK_RESET);
    return 0;
}

int usb_dc_ch32h417_usbss_set_address(uint8_t busid, uint8_t addr)
{
    (void)busid;
    g_ch32h417_usbss_udc.dev_addr = addr;
    g_ch32h417_usbss_udc.addr_pending = 1U;
    g_ch32h417_usbss_diag.set_addr++;
    g_ch32h417_usbss_diag.last_addr = addr;
    return 0;
}

int usb_dc_ch32h417_usbss_set_remote_wakeup(uint8_t busid)
{
    (void)busid;
    return -1;
}

uint8_t usb_dc_ch32h417_usbss_get_port_speed(uint8_t busid)
{
    (void)busid;
    return USB_SPEED_SUPER;
}

int usb_dc_ch32h417_usbss_ep_open(uint8_t busid, const struct usb_endpoint_descriptor *ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep->bEndpointAddress);
    uint16_t ep_mps = USB_GET_MAXPACKETSIZE(ep->wMaxPacketSize);
    uint8_t ep_type = USB_GET_ENDPOINT_TYPE(ep->bmAttributes);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        usbss_ep0_state_init();
        return 0;
    }

    if ((ep_mps == 0U) || (ep_mps > USBSS_EP_BUFFER_SIZE)) {
        ep_mps = USBSS_EP_BUFFER_SIZE;
    }

    if (USB_EP_DIR_IS_OUT(ep->bEndpointAddress)) {
        USBSS_EP_RX_TypeDef *rx = usbss_rx_ep(ep_idx);

        if (rx == RT_NULL) {
            return -1;
        }
        g_ch32h417_usbss_udc.out_ep[ep_idx].ep_mps = ep_mps;
        g_ch32h417_usbss_udc.out_ep[ep_idx].ep_type = ep_type;
        g_ch32h417_usbss_udc.out_ep[ep_idx].ep_enabled = 1U;
        g_ch32h417_usbss_udc.out_ep[ep_idx].ep_stalled = 0U;
        rx->UEP_RX_CFG = USBSS_EP_RX_SEQ_AUTO;
        rx->UEP_RX_DMA = (uint32_t)usbss_ep_rx_buffer[ep_idx];
        rx->UEP_RX_DMA_OFS = 0U;
        rx->UEP_RX_CHAIN_MAX_NUMP = 1U;
        rx->UEP_RX_CR = USBSS_EP_RX_CLR | USBSS_EP_RX_CHAIN_CLR;
        USBSSD->UEP_RX_EN |= (uint16_t)(1U << ep_idx);
    } else {
        USBSS_EP_TX_TypeDef *tx = usbss_tx_ep(ep_idx);

        if (tx == RT_NULL) {
            return -1;
        }
        g_ch32h417_usbss_udc.in_ep[ep_idx].ep_mps = ep_mps;
        g_ch32h417_usbss_udc.in_ep[ep_idx].ep_type = ep_type;
        g_ch32h417_usbss_udc.in_ep[ep_idx].ep_enabled = 1U;
        g_ch32h417_usbss_udc.in_ep[ep_idx].ep_stalled = 0U;
        tx->UEP_TX_CFG = USBSS_EP_TX_SEQ_AUTO;
        tx->UEP_TX_DMA = (uint32_t)usbss_ep_tx_buffer[ep_idx];
        tx->UEP_TX_DMA_OFS = 0U;
        tx->UEP_TX_CHAIN_LEN = 0U;
        tx->UEP_TX_CHAIN_EXP_NUMP = 1U;
        tx->UEP_TX_CR = USBSS_EP_TX_CLR | USBSS_EP_TX_CHAIN_CLR;
        USBSSD->UEP_TX_EN |= (uint16_t)(1U << ep_idx);
    }

    return 0;
}

int usb_dc_ch32h417_usbss_ep_close(uint8_t busid, uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        g_ch32h417_usbss_udc.in_ep[0].ep_enabled = 0U;
        g_ch32h417_usbss_udc.out_ep[0].ep_enabled = 0U;
    } else if (USB_EP_DIR_IS_OUT(ep)) {
        g_ch32h417_usbss_udc.out_ep[ep_idx].ep_enabled = 0U;
        USBSSD->UEP_RX_EN &= (uint16_t)~(1U << ep_idx);
    } else {
        g_ch32h417_usbss_udc.in_ep[ep_idx].ep_enabled = 0U;
        USBSSD->UEP_TX_EN &= (uint16_t)~(1U << ep_idx);
    }

