dasdasd12/hardware/firmware/h417_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbss.c
    return 0;
}

int usb_dc_ch32h417_usbss_set_stall(uint8_t busid, uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        USBSSD->UEP0_TX_CTRL = USBSS_EP0_TX_STALL;
        USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_STALL;
        g_ch32h417_usbss_udc.in_ep[0].ep_stalled = 1U;
        g_ch32h417_usbss_udc.out_ep[0].ep_stalled = 1U;
        g_ch32h417_usbss_diag.stall++;
    } else if (USB_EP_DIR_IS_OUT(ep)) {
        USBSS_EP_RX_TypeDef *rx = usbss_rx_ep(ep_idx);
        if (rx != RT_NULL) {
            rx->UEP_RX_CR |= USBSS_EP_RX_HALT;
        }
        g_ch32h417_usbss_udc.out_ep[ep_idx].ep_stalled = 1U;
    } else {
        USBSS_EP_TX_TypeDef *tx = usbss_tx_ep(ep_idx);
        if (tx != RT_NULL) {
            tx->UEP_TX_CR |= USBSS_EP_TX_HALT;
        }
        g_ch32h417_usbss_udc.in_ep[ep_idx].ep_stalled = 1U;
    }

    return 0;
}

int usb_dc_ch32h417_usbss_clear_stall(uint8_t busid, uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    if (ep_idx == 0U) {
        USBSSD->UEP0_TX_CTRL = 0U;
        USBSSD->UEP0_RX_CTRL = USBSS_EP0_RX_ERDY | USBSS_EP0_RX_ACK;
        g_ch32h417_usbss_udc.in_ep[0].ep_stalled = 0U;
        g_ch32h417_usbss_udc.out_ep[0].ep_stalled = 0U;
    } else if (USB_EP_DIR_IS_OUT(ep)) {
        USBSS_EP_RX_TypeDef *rx = usbss_rx_ep(ep_idx);
        if (rx != RT_NULL) {
            rx->UEP_RX_CR = USBSS_EP_RX_CLR | USBSS_EP_RX_CHAIN_CLR;
        }
        g_ch32h417_usbss_udc.out_ep[ep_idx].ep_stalled = 0U;
    } else {
        USBSS_EP_TX_TypeDef *tx = usbss_tx_ep(ep_idx);
        if (tx != RT_NULL) {
            tx->UEP_TX_CR = USBSS_EP_TX_CLR | USBSS_EP_TX_CHAIN_CLR;
        }
        g_ch32h417_usbss_udc.in_ep[ep_idx].ep_stalled = 0U;
    }

    return 0;
}

int usb_dc_ch32h417_usbss_is_stalled(uint8_t busid, uint8_t ep, uint8_t *stalled)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if ((ep_idx >= USB_CH32H417_MAX_EP_NUM) || (stalled == RT_NULL)) {
        return -1;
    }

    *stalled = USB_EP_DIR_IS_OUT(ep) ?
               g_ch32h417_usbss_udc.out_ep[ep_idx].ep_stalled :
               g_ch32h417_usbss_udc.in_ep[ep_idx].ep_stalled;
    return 0;
}

int usb_dc_ch32h417_usbss_start_write(uint8_t busid, uint8_t ep, const uint8_t *data, uint32_t data_len)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    uint32_t ep_mps;
    uint32_t send_len;

    (void)busid;

    if ((data == RT_NULL) && (data_len != 0U)) {
        return -1;
    }
    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    ep_mps = g_ch32h417_usbss_udc.in_ep[ep_idx].ep_mps;
    if (ep_mps == 0U) {
        ep_mps = (ep_idx == 0U) ? USB_CH32H417_SS_EP0_MPS : USBSS_EP_BUFFER_SIZE;
    }

    g_ch32h417_usbss_udc.in_ep[ep_idx].xfer_buf = (uint8_t *)data;
    g_ch32h417_usbss_udc.in_ep[ep_idx].xfer_len = data_len;
    g_ch32h417_usbss_udc.in_ep[ep_idx].actual_xfer_len = 0U;

    send_len = (data_len > ep_mps) ? ep_mps : data_len;
    usbss_ep_prime_in(ep_idx, data, send_len);
    return 0;
}

int usb_dc_ch32h417_usbss_start_read(uint8_t busid, uint8_t ep, uint8_t *data, uint32_t data_len)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    (void)busid;

    if ((data == RT_NULL) && (data_len != 0U)) {
        return -1;
    }
    if (ep_idx >= USB_CH32H417_MAX_EP_NUM) {
        return -1;
    }

    g_ch32h417_usbss_udc.out_ep[ep_idx].xfer_buf = data;
    g_ch32h417_usbss_udc.out_ep[ep_idx].xfer_len = data_len;
    g_ch32h417_usbss_udc.out_ep[ep_idx].actual_xfer_len = 0U;
    usbss_ep_prime_out(ep_idx);
    return 0;
}

static void usbss_irq_handler(uint8_t busid)
{
    uint32_t status = USBSSD->USB_STATUS;
    uint8_t ep_idx;
    uint32_t ep_dir;

    g_ch32h417_usbss_diag.irq++;
    g_ch32h417_usbss_diag.last_status = status;

    if ((status & USBSS_UDIF_SETUP) && ((status & USBSS_UDIF_STATUS) == 0U)) {
        usbss_handle_setup_packet(busid);
        USBSSD->USB_STATUS = USBSS_UDIF_SETUP;
        return;
    }

    if ((status & USBSS_UDIF_STATUS) != 0U) {
        USBSSD->USB_STATUS = USBSS_UDIF_STATUS;
        usbss_handle_status_stage(busid);
        return;
    }

    if ((status & USBSS_UIF_TRANSFER) != 0U) {
        g_ch32h417_usbss_diag.transfer++;
        ep_idx = (uint8_t)((status & USBSS_EP_ID_MASK) >> 8);
        ep_dir = status & USBSS_EP_DIR_MASK;
        if (ep_idx < USB_CH32H417_MAX_EP_NUM) {
            if (ep_dir != 0U) {
                usbss_handle_ep_in_xfer_complete(busid, ep_idx);
            } else {
                usbss_handle_ep_out_xfer_complete(busid, ep_idx);
            }
        }
        USBSSD->USB_STATUS = USBSS_UIF_TRANSFER;
    }
}

static void usbss_link_irq_handler(uint8_t busid)
{
    uint32_t link_int = USBSSD->LINK_INT_FLAG;
    uint32_t link_status = USBSSD->LINK_STATUS;
    uint32_t link_state = link_status & LINK_STATE_MASK;
    uint32_t link_lmp_data0;

    g_ch32h417_usbss_diag.link_irq++;
    g_ch32h417_usbss_diag.last_link_int = link_int;
    g_ch32h417_usbss_diag.last_link_state = link_state;
    g_ch32h417_usbss_diag.last_link_status = link_status;

    if ((link_status & LINK_RX_DETECT) != 0U) {
        g_ch32h417_usbss_diag.rx_detect_seen++;
    }
    if ((link_status & LINK_RX_LFPS) != 0U) {
        g_ch32h417_usbss_diag.rx_lfps_seen++;
    }
    if ((link_status & LINK_RX_TERM_PRES) != 0U) {
        g_ch32h417_usbss_diag.term_seen++;
    }
    if ((link_status & LINK_READY) != 0U) {
        g_ch32h417_usbss_diag.ready_seen++;
    }

    if (link_int == 0U) {
        return;
    }

    if ((link_int & LINK_IF_STATE_CHG) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_STATE_CHG;

        if (link_state == LINK_STATE_DISABLE) {
            g_ch32h417_usbss_diag.disable++;
            USBSSD->LINK_CTRL &= ~LINK_GO_DISABLED;
            if ((g_ch32h417_usbss_diag.rxdet != 0U) ||
                (g_ch32h417_usbss_diag.rxdet_flag != 0U) ||
                (g_ch32h417_usbss_diag.rx_detect_seen != 0U)) {
                usbss_request_hs_fallback(USBSS_HS_FALLBACK_REASON_DISABLE);
            }
        } else if (link_state == LINK_STATE_RXDET) {
            g_ch32h417_usbss_diag.rxdet++;
            g_ch32h417_usbss_diag.rxdet_no_reset++;
        } else if (link_state == LINK_STATE_HOTRST) {
            g_ch32h417_usbss_diag.hotrst++;
            usbss_device_reset(busid, 1U);
            USBSSD->LINK_CTRL &= ~LINK_HOT_RESET;
        } else if (link_state == LINK_STATE_U0) {
            g_ch32h417_usbss_diag.u0++;
            usbd_event_connect_handler(busid);
        } else if (link_state == LINK_STATE_U1) {
            g_ch32h417_usbss_diag.u1++;
        } else if (link_state == LINK_STATE_U2) {
            g_ch32h417_usbss_diag.u2++;
        } else if (link_state == LINK_STATE_U3) {
            g_ch32h417_usbss_diag.u3++;
            usbd_event_suspend_handler(busid);
        } else if (link_state == LINK_STATE_RECOVERY) {
            g_ch32h417_usbss_diag.recovery++;
            usbss_phy_cfg(0U, 0x12U, 0x67C8U);
        } else if (link_state == LINK_STATE_INACTIVE) {
            g_ch32h417_usbss_diag.inactive++;
            usbss_request_hs_fallback(USBSS_HS_FALLBACK_REASON_INACTIVE);
        } else if (link_state == LINK_STATE_POLLING) {
            g_ch32h417_usbss_diag.polling++;
        }
    }

    if ((link_int & LINK_IF_TERM_PRES) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_TERM_PRES;
    }

    if ((link_int & LINK_IF_RX_DET) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_RX_DET;
        g_ch32h417_usbss_diag.rxdet_flag++;
        if (g_ch32h417_usbss_diag.disable != 0U) {
            usbss_request_hs_fallback(USBSS_HS_FALLBACK_REASON_DISABLE);
        }
    }

    if ((link_int & LINK_IF_DISABLE) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_DISABLE;
        g_ch32h417_usbss_diag.disable_flag++;
    }

    if ((link_int & LINK_IF_READY) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_READY;
        g_ch32h417_usbss_diag.ready_flag++;
    }

    if ((link_int & LINK_IF_UX_FAIL) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_UX_FAIL;
        g_ch32h417_usbss_diag.ux_fail_flag++;
    }

