dasdasd12/hardware/firmware/h417_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbss.c
    if ((link_int & LINK_IF_UX_EXIT_FAIL) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_UX_EXIT_FAIL;
        g_ch32h417_usbss_diag.ux_exit_fail_flag++;
    }

    if ((link_int & LINK_IF_GO_U0) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_GO_U0;
        g_ch32h417_usbss_diag.go_u0_flag++;
    }

    if ((link_int & LINK_IF_RECOVERY) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_RECOVERY;
        g_ch32h417_usbss_diag.recovery_flag++;
    }

    if ((link_int & LINK_IF_INACTIVE) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_INACTIVE;
        g_ch32h417_usbss_diag.inactive_flag++;
        usbss_request_hs_fallback(USBSS_HS_FALLBACK_REASON_INACTIVE);
    }

    if ((link_int & LINK_IF_TXEQ) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_TXEQ;
        g_ch32h417_usbss_diag.txeq_flag++;
    }

    if ((link_int & LINK_IF_UX_REJ) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_UX_REJ;
        g_ch32h417_usbss_diag.ux_rej_flag++;
    }

    if ((link_int & LINK_IF_RX_LMP_TOUT) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_RX_LMP_TOUT;
        g_ch32h417_usbss_diag.rx_lmp_tout_flag++;
        USBSSD->LINK_CTRL |= LINK_GO_DISABLED;
        USBSSD->LINK_CTRL |= LINK_GO_RX_DET;
    }

    if ((link_int & LINK_IF_TX_LMP) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_TX_LMP;
        USBSSD->LINK_LMP_TX_DATA0 = LMP_LINK_SPEED | LMP_PORT_CAP | LMP_HP;
        USBSSD->LINK_LMP_TX_DATA1 = (USBSSD->LINK_CFG & LINK_DOWN_MODE) ? (DOWN_STREAM | NUM_HP_BUF) : (UP_STREAM | NUM_HP_BUF);
        USBSSD->LINK_LMP_TX_DATA2 = 0U;
    }

    if ((link_int & LINK_IF_RX_LMP) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_RX_LMP;
        link_lmp_data0 = USBSSD->LINK_LMP_RX_DATA0;

        if ((USBSSD->LINK_CFG & LINK_DOWN_MODE) == 0U) {
            if ((link_lmp_data0 & LMP_SUBTYPE_MASK) == LMP_PORT_CFG) {
                USBSSD->LINK_LMP_TX_DATA0 = LMP_LINK_SPEED | LMP_PORT_CFG_RES | LMP_HP;
                USBSSD->LINK_LMP_TX_DATA1 = 0U;
                USBSSD->LINK_LMP_TX_DATA2 = 0U;
                USBSSD->LINK_LMP_PORT_CAP |= LINK_LMP_TX_CAP_VLD;
            } else if ((link_lmp_data0 & LMP_SUBTYPE_MASK) == LMP_U2_INACT_TOUT) {
                USBSSD->LINK_U2_INACT_TIMER = (uint8_t)((link_lmp_data0 >> 9) & 0xFFU);
            } else if ((link_lmp_data0 & LMP_SUBTYPE_MASK) == LMP_SET_LINK_FUNC) {
                if ((link_lmp_data0 & (0x02U << 9)) != 0U) {
                    USBSSD->LINK_CFG |= LINK_U1_ALLOW | LINK_U2_ALLOW;
                } else {
                    USBSSD->LINK_CFG &= ~(LINK_U1_ALLOW | LINK_U2_ALLOW);
                }
            }
        }
    }

    if ((link_int & LINK_IF_WARM_RST) != 0U) {
        USBSSD->LINK_INT_FLAG = LINK_IF_WARM_RST;
        if ((USBSSD->LINK_STATUS & LINK_RX_WARM_RST) != 0U) {
            g_ch32h417_usbss_diag.warmrst++;
            usbss_device_reset(busid, 1U);
            USBSSD->LINK_CTRL |= LINK_GO_DISABLED;
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            USBSSD->LINK_CTRL &= ~LINK_GO_DISABLED;
        }
    }
}

void ch32h417_usbss_isr(void)
{
    usbss_irq_handler(USB_CH32H417_BUS_SS);
}

void ch32h417_usbss_link_isr(void)
{
    usbss_link_irq_handler(USB_CH32H417_BUS_SS);
}

struct usbss_link_sweep_mode {
    const char *name;
    uint32_t cfg_extra;
    uint32_t ctrl_extra;
};

static void usbss_link_sweep_once(void)
{
    static const struct usbss_link_sweep_mode modes[] = {
        { "official", 0U, 0U },
        { "swap", LINK_SS_PLR_SWAP, 0U },
        { "force_term", LINK_FORCE_RXTERM, 0U },
        { "force_term_swap", LINK_FORCE_RXTERM | LINK_SS_PLR_SWAP, 0U },
        { "force_poll_swap", LINK_FORCE_RXTERM | LINK_FORCE_POLLING | LINK_SS_PLR_SWAP, LINK_POLLING_EN },
    };
    uint32_t i;
    uint32_t sample;
    int best = -1;

    if (USBSS_ENABLE_LINK_SWEEP == 0U) {
        return;
    }

    if (g_ch32h417_usbss_sweep_done != 0U) {
        return;
    }
    g_ch32h417_usbss_sweep_done = 1U;

    if ((*USBSS_READY_FLAG_ADDR != USBSS_READY_FLAG_VALUE) ||
        (g_ch32h417_usbss_diag.u0 != 0U) ||
        (g_ch32h417_usbss_diag.setup != 0U)) {
        return;
    }

    NVIC_DisableIRQ(USBSS_LINK_IRQn);
    NVIC_DisableIRQ(USBSS_IRQn);

    for (i = 0U; i < (sizeof(modes) / sizeof(modes[0])); i++) {
        uint32_t link_int = 0U;
        uint32_t last_status = 0U;
        uint32_t rxdet = 0U;
        uint32_t disable = 0U;
        uint32_t polling = 0U;
        uint32_t lfps = 0U;
        uint32_t term = 0U;
        uint32_t ready = 0U;
        uint32_t u0 = 0U;

        USBSSD->LINK_INT_CTRL = 0U;
        USBSSD->LINK_INT_FLAG = 0xFFFFFFFFU;
        usbss_link_program(modes[i].cfg_extra, modes[i].ctrl_extra);
        usbss_delay(1000U);

        for (sample = 0U; sample < USBSS_LINK_SWEEP_DELAY; sample++) {
            uint32_t status = USBSSD->LINK_STATUS;
            uint32_t state = status & LINK_STATE_MASK;

            last_status = status;
            link_int |= USBSSD->LINK_INT_FLAG;
            if (state == LINK_STATE_RXDET) {
                rxdet = 1U;
            } else if (state == LINK_STATE_DISABLE) {
                disable = 1U;
            } else if (state == LINK_STATE_POLLING) {
                polling = 1U;
            } else if (state == LINK_STATE_U0) {
                u0 = 1U;
            }
            if ((status & LINK_RX_LFPS) != 0U) {
                lfps = 1U;
            }
            if ((status & LINK_RX_TERM_PRES) != 0U) {
                term = 1U;
            }
            if ((status & LINK_READY) != 0U) {
                ready = 1U;
            }
            if ((u0 != 0U) || (ready != 0U)) {
                break;
            }
        }

        rt_kprintf("[USBSS sweep] mode=%s cfg=0x%08x ctrl=0x%08x int=0x%08x last=0x%08x rxdet=%u dis=%u poll=%u lfps=%u term=%u ready=%u u0=%u\r\n",
                   modes[i].name,
                   (unsigned int)(LINK_RX_EQ_EN | LINK_TX_DEEMPH_MASK | LINK_LTSSM_MODE | LINK_TOUT_MODE | LINK_RX_TERM_EN | modes[i].cfg_extra),
                   (unsigned int)(LINK_P2_MODE | modes[i].ctrl_extra),
                   (unsigned int)link_int,
                   (unsigned int)last_status,
                   (unsigned int)rxdet,
                   (unsigned int)disable,
                   (unsigned int)polling,
                   (unsigned int)lfps,
                   (unsigned int)term,
                   (unsigned int)ready,
                   (unsigned int)u0);

