dasdasd12/hardware/firmware/h417_rtthread/rt-thread/components/drivers/usb/cherryusb/port/ch32h417/usb_dc_ch32h417_usbss.c
        if ((u0 != 0U) || (ready != 0U)) {
            best = (int)i;
            break;
        }
    }

    if (best >= 0) {
        usbss_link_program(modes[best].cfg_extra, modes[best].ctrl_extra);
    } else {
        usbss_link_init();
    }
    usbss_cfg_mod();
    usbss_device_reset(USB_CH32H417_BUS_SS, 0U);

    NVIC_EnableIRQ(USBSS_IRQn);
    NVIC_EnableIRQ(USBSS_LINK_IRQn);
}

uint8_t usb_dc_ch32h417_usbss_take_hs_fallback_request(uint32_t *reason)
{
    rt_base_t level;
    uint8_t pending;

    level = rt_hw_interrupt_disable();
    pending = g_ch32h417_usbss_hs_fallback_request;
    if (pending != 0U) {
        if (reason != RT_NULL) {
            *reason = g_ch32h417_usbss_hs_fallback_reason;
        }
        g_ch32h417_usbss_hs_fallback_request = 0U;
    }
    rt_hw_interrupt_enable(level);

    return pending;
}

void usb_dc_ch32h417_usbss_dump_diag(void)
{
    usbss_link_sweep_once();
    usbss_sample_link_window();

    rt_kprintf("[USBSS diag] irq=%u link=%u reset=%u u0=%u rxdet=%u nrst=%u hotrst=%u warmrst=%u setup=%u status=%u xfer=%u\r\n",
               (unsigned int)g_ch32h417_usbss_diag.irq,
               (unsigned int)g_ch32h417_usbss_diag.link_irq,
               (unsigned int)g_ch32h417_usbss_diag.reset,
               (unsigned int)g_ch32h417_usbss_diag.u0,
               (unsigned int)g_ch32h417_usbss_diag.rxdet,
               (unsigned int)g_ch32h417_usbss_diag.rxdet_no_reset,
               (unsigned int)g_ch32h417_usbss_diag.hotrst,
               (unsigned int)g_ch32h417_usbss_diag.warmrst,
               (unsigned int)g_ch32h417_usbss_diag.setup,
               (unsigned int)g_ch32h417_usbss_diag.status,
               (unsigned int)g_ch32h417_usbss_diag.transfer);
    rt_kprintf("[USBSS diag] pIN0=%u in0=%u pOUT0=%u out0=%u stall=%u addr=%u st=0x%08x lint=0x%08x lst=0x%08x\r\n",
               (unsigned int)g_ch32h417_usbss_diag.ep0_prime_in,
               (unsigned int)g_ch32h417_usbss_diag.ep0_in,
               (unsigned int)g_ch32h417_usbss_diag.ep0_prime_out,
               (unsigned int)g_ch32h417_usbss_diag.ep0_out,
               (unsigned int)g_ch32h417_usbss_diag.stall,
               (unsigned int)g_ch32h417_usbss_diag.last_addr,
               (unsigned int)g_ch32h417_usbss_diag.last_status,
               (unsigned int)g_ch32h417_usbss_diag.last_link_int,
               (unsigned int)g_ch32h417_usbss_diag.last_link_state);
    rt_kprintf("[USBSS diag] setup=%08x/%08x resp=%08x tx=%u rx=%u\r\n",
               (unsigned int)g_ch32h417_usbss_diag.last_setup0,
               (unsigned int)g_ch32h417_usbss_diag.last_setup1,
               (unsigned int)g_ch32h417_usbss_diag.last_resp0,
               (unsigned int)g_ch32h417_usbss_diag.last_tx_len,
               (unsigned int)g_ch32h417_usbss_diag.last_rx_len);
    rt_kprintf("[USBSS link] rxdet_if=%u disable_if=%u\r\n",
               (unsigned int)g_ch32h417_usbss_diag.rxdet_flag,
               (unsigned int)g_ch32h417_usbss_diag.disable_flag);
    rt_kprintf("[USBSS states] dis=%u inact=%u poll=%u rec=%u u1=%u u2=%u u3=%u rxd=%u lfps=%u term=%u ready=%u lstat=0x%08x\r\n",
               (unsigned int)g_ch32h417_usbss_diag.disable,
               (unsigned int)g_ch32h417_usbss_diag.inactive,
               (unsigned int)g_ch32h417_usbss_diag.polling,
               (unsigned int)g_ch32h417_usbss_diag.recovery,
               (unsigned int)g_ch32h417_usbss_diag.u1,
               (unsigned int)g_ch32h417_usbss_diag.u2,
               (unsigned int)g_ch32h417_usbss_diag.u3,
               (unsigned int)g_ch32h417_usbss_diag.rx_detect_seen,
               (unsigned int)g_ch32h417_usbss_diag.rx_lfps_seen,
               (unsigned int)g_ch32h417_usbss_diag.term_seen,
               (unsigned int)g_ch32h417_usbss_diag.ready_seen,
               (unsigned int)g_ch32h417_usbss_diag.last_link_status);
    rt_kprintf("[USBSS flags] pen=%u rdy=%u ux=%u uxe=%u gu0=%u rec=%u ina=%u txeq=%u rej=%u lmp_to=%u\r\n",
               (unsigned int)g_ch32h417_usbss_diag.polling_enable,
               (unsigned int)g_ch32h417_usbss_diag.ready_flag,
               (unsigned int)g_ch32h417_usbss_diag.ux_fail_flag,
               (unsigned int)g_ch32h417_usbss_diag.ux_exit_fail_flag,
               (unsigned int)g_ch32h417_usbss_diag.go_u0_flag,
               (unsigned int)g_ch32h417_usbss_diag.recovery_flag,
               (unsigned int)g_ch32h417_usbss_diag.inactive_flag,
               (unsigned int)g_ch32h417_usbss_diag.txeq_flag,
               (unsigned int)g_ch32h417_usbss_diag.ux_rej_flag,
               (unsigned int)g_ch32h417_usbss_diag.rx_lmp_tout_flag);
    rt_kprintf("[USBSS sample] n=%u first=0x%08x last=0x%08x or=0x%08x and=0x%08x rxdet=%u lfps=%u term=%u ready=%u dis=%u poll=%u rec=%u u0=%u\r\n",
               (unsigned int)g_ch32h417_usbss_diag.sample_count,
               (unsigned int)g_ch32h417_usbss_diag.sample_first,
               (unsigned int)g_ch32h417_usbss_diag.sample_last,
               (unsigned int)g_ch32h417_usbss_diag.sample_or,
               (unsigned int)g_ch32h417_usbss_diag.sample_and,
               (unsigned int)g_ch32h417_usbss_diag.sample_rxdet,
               (unsigned int)g_ch32h417_usbss_diag.sample_lfps,
               (unsigned int)g_ch32h417_usbss_diag.sample_term,
               (unsigned int)g_ch32h417_usbss_diag.sample_ready,
               (unsigned int)g_ch32h417_usbss_diag.sample_disable,
               (unsigned int)g_ch32h417_usbss_diag.sample_polling,
               (unsigned int)g_ch32h417_usbss_diag.sample_recovery,
               (unsigned int)g_ch32h417_usbss_diag.sample_u0);
    rt_kprintf("[USBSS regs] ctl=0x%08x sta=0x%08x lcfg=0x%08x lctl=0x%08x\r\n",
               (unsigned int)USBSSD->USB_CONTROL,
               (unsigned int)USBSSD->USB_STATUS,
               (unsigned int)USBSSD->LINK_CFG,
               (unsigned int)USBSSD->LINK_CTRL);
    rt_kprintf("[USBSS regs2] lint=0x%08x lstat=0x%08x lpm=0x%04x cap=0x%08x rx0=0x%08x tx0=0x%08x ep0=%08x/%08x\r\n",
               (unsigned int)USBSSD->LINK_INT_FLAG,
               (unsigned int)USBSSD->LINK_STATUS,
               (unsigned int)USBSSD->LINK_LPM_CR,
               (unsigned int)USBSSD->LINK_LMP_PORT_CAP,
               (unsigned int)USBSSD->LINK_LMP_RX_DATA0,
               (unsigned int)USBSSD->LINK_LMP_TX_DATA0,
               (unsigned int)USBSSD->UEP0_TX_CTRL,
               (unsigned int)USBSSD->UEP0_RX_CTRL);
    rt_kprintf("[USBSS v3f] stage=%u idle=%u flag=0x%08x phy=0x%08x mod=0x%08x\r\n",
               (unsigned int)USBSS_V3F_TRACE_BASE[1],
               (unsigned int)USBSS_V3F_TRACE_BASE[4],
               (unsigned int)USBSS_V3F_TRACE_BASE[8],
               (unsigned int)USBSS_V3F_TRACE_BASE[9],
               (unsigned int)USBSS_V3F_TRACE_BASE[10]);
    rt_kprintf("[USBSS v3fl] cfg=0x%08x ctl=0x%08x st0=0x%08x st1=0x%08x lint=0x%08x lpm=0x%08x uctl=0x%08x ust=0x%08x\r\n",
               (unsigned int)USBSS_V3F_TRACE_BASE[11],
               (unsigned int)USBSS_V3F_TRACE_BASE[12],
               (unsigned int)USBSS_V3F_TRACE_BASE[13],
               (unsigned int)USBSS_V3F_TRACE_BASE[14],
               (unsigned int)USBSS_V3F_TRACE_BASE[15],
               (unsigned int)USBSS_V3F_TRACE_BASE[16],
               (unsigned int)USBSS_V3F_TRACE_BASE[17],
               (unsigned int)USBSS_V3F_TRACE_BASE[18]);
    rt_kprintf("[USBSS tune] wait=%u pst=0x%08x termst=0x%08x v3wait=%u v3pst=0x%08x v3term=0x%08x\r\n",
               (unsigned int)g_ch32h417_usbss_diag.link_busy_wait,
               (unsigned int)g_ch32h417_usbss_diag.post_busy_status,
               (unsigned int)g_ch32h417_usbss_diag.post_term_status,
               (unsigned int)USBSS_V3F_TRACE_BASE[19],
               (unsigned int)USBSS_V3F_TRACE_BASE[20],
               (unsigned int)USBSS_V3F_TRACE_BASE[21]);
    rt_kprintf("[USBSS phy] r03=0x%08x r0d=0x%08x r11=0x%08x r12=0x%08x r13=0x%08x r15=0x%08x\r\n",
               (unsigned int)g_ch32h417_usbss_diag.phy_r03,
               (unsigned int)g_ch32h417_usbss_diag.phy_r0d,
               (unsigned int)g_ch32h417_usbss_diag.phy_r11,
               (unsigned int)g_ch32h417_usbss_diag.phy_r12,
               (unsigned int)g_ch32h417_usbss_diag.phy_r13,
               (unsigned int)g_ch32h417_usbss_diag.phy_r15);
    rt_kprintf("[USBSS phy2] cr=0x%08x dat=0x%08x mod=0x%08x rctl=0x%08x pll2=0x%08x hb=0x%08x\r\n",
               (unsigned int)g_ch32h417_usbss_diag.phy_cfg_cr,
               (unsigned int)g_ch32h417_usbss_diag.phy_cfg_dat,
               (unsigned int)g_ch32h417_usbss_diag.phy_mod,
               (unsigned int)g_ch32h417_usbss_diag.rcc_ctlr,
               (unsigned int)g_ch32h417_usbss_diag.rcc_pllcfgr2,
               (unsigned int)g_ch32h417_usbss_diag.rcc_hbpcenr);
}

void USBSS_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void USBSS_IRQHandler(void)
{
    GET_INT_SP();
    rt_interrupt_enter();
    usbss_irq_handler(USB_CH32H417_BUS_SS);
    rt_interrupt_leave();
    FREE_INT_SP();
}

void USBSS_LINK_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));
void USBSS_LINK_IRQHandler(void)
{
    GET_INT_SP();
    rt_interrupt_enter();
    usbss_link_irq_handler(USB_CH32H417_BUS_SS);
    rt_interrupt_leave();
    FREE_INT_SP();
}
